title: Trojan.Generic malware detection
id: Trojan.G-3377608d
status: experimental
description: Detects Trojan.Generic malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to execute an application (API string)
  - EventType: Able to create/load registry keys (API string)
  - EventType: Contains ability to execute Windows APIs
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to retrieve/open a process (API string)
  - EventType: Able to use GrayString API for text rendering
  - EventType: Contains ability to retrieve the command-line string for the current
      process (API string)
  - EventType: Contains ability to create directories (API string)
  - DestinationIp: 106.52.51.128
  condition: selection
tags:
- malware
- Trojan.Generic
