title: Trojan.Generic malware detection
id: Trojan.G-b2e8b357
status: experimental
description: Detects Trojan.Generic malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Can load assembly that contains the code that is currently executing
      (Dotnet)
  - EventType: Contains ability to execute an application (API string)
  - EventType: Contains registry location strings
  - EventType: Contains ability to execute Windows APIs
  - EventType: Able to retrieve command line parameters of the running process
  - EventType: Contains ability to set/get the last-error code for a calling thread
      (API string)
  - EventType: Found E-Mail address in binary/memory
  - EventType: Contains ability to retrieve/open a process (API string)
  - DestinationHostname: de5b.northstar.api.socdn.com
  condition: selection
tags:
- malware
- Trojan.Generic
