title: babar.Generic malware detection
id: babar.Ge-3431c89f
status: experimental
description: Detects babar.Generic malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to execute an application (API string)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to executes commands or batch file
  - EventType: Contains registry location strings
  - EventType: Contains ability to set/get the last-error code for a calling thread
      (API string)
  - EventType: Able to retrieve command line parameters of the running process
  - EventType: Contains ability to execute Windows APIs
  condition: selection
tags:
- malware
- babar.Generic
