title: Application.Cerbu.Generic malware detection
id: Applicat-e305dd6a
status: experimental
description: Detects Application.Cerbu.Generic malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains registry location strings
  - EventType: Able to retrieve command line parameters of the running process
  - EventType: Contains ability to find and load resources of specific modules (API
      string)
  - EventType: Contains ability to set/get the last-error code for a calling thread
      (API string)
  - EventType: Contains ability to execute Windows APIs
  - EventType: Contains ability to execute an application (API string)
  - DestinationHostname: controlprice.xyz
  - DestinationIp: 172.67.217.46
  condition: selection
tags:
- malware
- Application.Cerbu.Generic
