title: Mirai.AR trojan behavior detection (48b7258a)
id: 48b7258a9addbd13d2ab829402db292c214af089fdc4f987a66df429ef1bd90f
status: experimental
description: Auto-generated Sigma rule for Mirai.AR trojan
logsource:
  product: windows
  service: sysmon
detection:
  selection_behavior:
  - EventData: "Calls a syscall: \"execve\"\n Calls a syscall: \"open\"\n Calls a\
      \ syscall: \"mmap\"\n Calls a syscall: \"mprotect\"\n Calls a syscall: \"readlink\"\
      \n Calls a syscall: \"brk\"\n Calls a syscall: \"munmap\"\n Calls a syscall:\
      \ \"close\"\n Calls a syscall: \"ioctl\"\n Calls a syscall: \"rt_sigprocmask\"\
      \n Calls a syscall: \"rt_sigaction\"\n Calls a syscall: \"socket\"\n Calls a\
      \ syscall: \"connect\"\n Calls a syscall: \"getsockname\"\n Calls a syscall:\
      \ \"procexit\""
  - EventData: Calls native functions (syscalls)
  - EventData: api-1150
  - EventData: 48b7258a9addbd13d2ab829402db292c214af089fdc4f987a66df429ef1bd90f.bin
      is stripped
  - EventData: Binary is stripped
  - EventData: static-1000
  - EventData: 'Found reference to API "PROT_EXEC|PROT_WRITE failed." (Indicator:
      "write"; File: "48b7258a9addbd13d2ab829402db292c214af089fdc4f987a66df429ef1bd90f.bin")'
  - EventData: Contains native function calls (syscalls strings)
  - EventData: string-5000
  - EventData: YARA signature for invalid unusual section file "sample.bin"
  - EventData: "YARA signature match \u2013 Anomalous ELF file structure"
  - EventData: yara-558
  - EventData: 'Pattern match: "http://upx.sf.net"'
  - EventData: Found potential URL in binary/memory
  - EventData: string-3
  - EventData: '/home/ubuntu/48b7258a9ad.bin executed: getsockname'
  - EventData: Calls a system call typically used to retrieve the current address
      to which the socket is bound
  - EventData: api-1152
  - EventData: Sample file "sample.bin" has high entropy 7.96371
  - EventData: Sample file has high entropy (likely encrypted/compressed content)
  - EventData: binary-71
  - EventData: 'The analysis contains indicators for crypto or data obfuscation(base64/decrypt)
      which can hide information. Matched sigs: Sample file has high entropy (likely
      encrypted/compressed content)'
  - EventData: Shows ability to obfuscate file or information
  - EventData: summary-28
  - EventData: 48b7258a9addbd13d2ab829402db292c214af089fdc4f987a66df429ef1bd90f.bin
      is statically linked
  - EventData: Binary is statically linked
  - EventData: static-1001
  - EventData: 7/26 Antivirus vendors marked sample as malicious (26% detection rate)
  - EventData: Sample was identified as malicious by at least one Antivirus engine
  - EventData: avtest-0
  - EventData: '48b7258a9addbd13d2ab829402db292c214af089fdc4f987a66df429ef1bd90f.bin
      entropy is: 7.963709592247561'
  - EventData: Binary is packed
  - EventData: static-1003
  - EventData: 48b7258a9addbd13d2ab829402db292c214af089fdc4f987a66df429ef1bd90f.bin
      section headers are modified/stripped
  - EventData: Section headers are modified/stripped
  - EventData: static-1004
  - EventData: The binary has been stripped of all debug symbols and its shared objects
      are also statically linked to the binary
  - EventData: The binary is stripped and also statically linked
  - EventData: summary-1000
  - EventData: 'CrowdStrike Static Analysis and ML (QuickScan) yielded detection:
      linux/malicious_confidence_100% (W)'
  - EventData: Sample detected by CrowdStrike Static Analysis and ML with relatively
      high confidence
  - EventData: avtest-8
  - EventData: No specific details available
  - EventData: Sample was identified as malicious by a trusted Antivirus engine
  - EventData: avtest-5
  selection_network: []
  condition: selection_behavior or selection_network
