title: Mirai.AR trojan behavior detection (ad703b95)
id: ad703b9521823df06995fff60e27709551e6fb70c48202b9372677d20fed5dd1
status: experimental
description: Auto-generated Sigma rule for Mirai.AR trojan
logsource:
  product: windows
  service: sysmon
detection:
  selection_behavior:
  - EventData: "Calls a syscall: \"procexit\"\n Calls a syscall: \"execve\"\n Calls\
      \ a syscall: \"open\"\n Calls a syscall: \"mmap\"\n Calls a syscall: \"mprotect\"\
      \n Calls a syscall: \"readlink\"\n Calls a syscall: \"mmap2\"\n Calls a syscall:\
      \ \"brk\"\n Calls a syscall: \"munmap\"\n Calls a syscall: \"close\"\n Calls\
      \ a syscall: \"ioctl\"\n Calls a syscall: \"rt_sigprocmask\"\n Calls a syscall:\
      \ \"rt_sigaction\"\n Calls a syscall: \"socket\"\n Calls a syscall: \"connect\"\
      \n Calls a syscall: \"getsockname\""
  - EventData: Calls native functions (syscalls)
  - EventData: api-1150
  - EventData: ad703b9521823df06995fff60e27709551e6fb70c48202b9372677d20fed5dd1.bin
      is stripped
  - EventData: Binary is stripped
  - EventData: static-1000
  - EventData: 'Found reference to API "mmap failed.Yj" (Indicator: "mmap"; File:
      "ad703b9521823df06995fff60e27709551e6fb70c48202b9372677d20fed5dd1.bin")'
  - EventData: Contains native function calls (syscalls strings)
  - EventData: string-5000
  - EventData: YARA signature for invalid unusual section file "sample.bin"
  - EventData: "YARA signature match \u2013 Anomalous ELF file structure"
  - EventData: yara-558
  - EventData: 'Pattern match: "http://upx.sf.net"'
  - EventData: Found potential URL in binary/memory
  - EventData: string-3
  - EventData: '/home/ubuntu/ad703b95218.bin executed: getsockname'
  - EventData: Calls a system call typically used to retrieve the current address
      to which the socket is bound
  - EventData: api-1152
  - EventData: Sample file "sample.bin" has high entropy 7.96022
  - EventData: Sample file has high entropy (likely encrypted/compressed content)
  - EventData: binary-71
  - EventData: 'The analysis contains indicators for crypto or data obfuscation(base64/decrypt)
      which can hide information. Matched sigs: Sample file has high entropy (likely
      encrypted/compressed content)'
  - EventData: Shows ability to obfuscate file or information
  - EventData: summary-28
  - EventData: ad703b9521823df06995fff60e27709551e6fb70c48202b9372677d20fed5dd1.bin
      is statically linked
  - EventData: Binary is statically linked
  - EventData: static-1001
  - EventData: 8/27 Antivirus vendors marked sample as malicious (29% detection rate)
  - EventData: Sample was identified as malicious by at least one Antivirus engine
  - EventData: avtest-0
  - EventData: 'ad703b9521823df06995fff60e27709551e6fb70c48202b9372677d20fed5dd1.bin
      entropy is: 7.960219132170488'
  - EventData: Binary is packed
  - EventData: static-1003
  - EventData: ad703b9521823df06995fff60e27709551e6fb70c48202b9372677d20fed5dd1.bin
      section headers are modified/stripped
  - EventData: Section headers are modified/stripped
  - EventData: static-1004
  - EventData: The binary has been stripped of all debug symbols and its shared objects
      are also statically linked to the binary
  - EventData: The binary is stripped and also statically linked
  - EventData: summary-1000
  - EventData: 'CrowdStrike Static Analysis and ML (QuickScan) yielded detection:
      linux/malicious_confidence_100% (W)'
  - EventData: Sample detected by CrowdStrike Static Analysis and ML with relatively
      high confidence
  - EventData: avtest-8
  - EventData: No specific details available
  - EventData: Sample was identified as malicious by a trusted Antivirus engine
  - EventData: avtest-5
  selection_network: []
  condition: selection_behavior or selection_network
