title: proximity behavior detection (39270a23)
id: 39270a231d843ca541009e1b35684da9fb1257825b10144395160cf765e6360b
status: experimental
description: Auto-generated Sigma rule for proximity
logsource:
  product: windows
  service: sysmon
detection:
  selection_behavior:
  - EventData: "The input sample is signed with a certificate issued by \"CN=E8, O=Let's\
      \ Encrypt, C=US\" (SHA1: 39:09:17:30:8A:9A:CF:D9:AF:6F:BE:16:58:6C:31:EA:F6:2A:3B:D5;\
      \ see report for more information)\n The input sample is signed with a certificate\
      \ issued by \"CN=ISRG Root X1, O=Internet Security Research Group, C=US\" (SHA1:\
      \ 54:31:7E:B0:76:5F:0B:C6:74:85:51:84:EB:83:74:B4:19:9E:46:55; see report for\
      \ more information)\n The input sample is signed with a certificate issued by\
      \ \"CN=E7, O=Let's Encrypt, C=US\" (SHA1: D0:C5:3A:BE:46:33:62:7B:8B:D5:92:25:24:FE:51:02:8A:6D:5F:DF;\
      \ see report for more information)\n The input sample is signed with a certificate\
      \ issued by \"CN=ISRG Root X1, O=Internet Security Research Group, C=US\" (SHA1:\
      \ 3B:73:C1:7E:3D:F8:7C:F3:AA:77:F1:38:92:19:EB:5E:DD:51:9E:7F; see report for\
      \ more information)\n The input sample is signed with a certificate issued by\
      \ \"CN=E8, O=Let's Encrypt, C=US\" (SHA1: 2F:5C:84:59:D5:30:00:E0:37:A2:1D:EB:D0:9C:0C:C7:A4:17:88:77;\
      \ see report for more information)"
  - EventData: The input sample is signed with a certificate
  - EventData: certificate-0
  - EventData: "Spawned process \"msedge.exe\" with commandline \"--single-argument\
      \ https://gcsurfaces.steris.psychplus.help/f/596 ...\" (UID: 00000000-00004808)\n\
      \ Spawned process \"msedge.exe\" with commandline \"--type=crashpad-handler\
      \ \"--user-data-dir=%LOCALAPPDATA%\\\\Microso ...\" (UID: 00000000-00006672),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=gpu-process --gpu-preferences=UAAAAAAAAADgAAAYAAAAAAAAAAA\
      \ ...\" (UID: 00000000-00004088), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=network.mojom.NetworkService - ...\" (UID:\
      \ 00000000-00005312), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=storage.mojom.StorageService - ...\" (UID: 00000000-00005284),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=renderer --display-capture-permissions-policy-allowed\
      \ --j ...\" (UID: 00000000-00007036), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=renderer --display-capture-permissions-policy-allowed --j ...\" (UID:\
      \ 00000000-00007640), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=asset_store.mojom.AssetStoreSe ...\" (UID: 00000000-00001588),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=renderer --display-capture-permissions-policy-allowed\
      \ --j ...\" (UID: 00000000-00004684), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=data_decoder.mojom.DataDecoder ...\" (UID:\
      \ 00000000-00003456), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=entity_extraction_service.mojo ...\" (UID: 00000000-00005812),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=data_decoder.mojom.DataDecoder\
      \ ...\" (UID: 00000000-00004324), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=data_decoder.mojom.DataDecoder ...\" (UID:\
      \ 00000000-00007608), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=data_decoder.mojom.DataDecoder ...\" (UID: 00000000-00001684),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=data_decoder.mojom.DataDecoder\
      \ ...\" (UID: 00000000-00005764), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID:\
      \ 00000000-00007372), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID: 00000000-00006660),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper\
      \ --lang=en ...\" (UID: 00000000-00007832), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en\
      \ ...\" (UID: 00000000-00005584), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=gpu-process --disable-gpu-sandbox --use-gl=disabled --gpu ...\" (UID:\
      \ 00000000-00008124), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID: 00000000-00007308),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper\
      \ --lang=en ...\" (UID: 00000000-00007428), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en\
      \ ...\" (UID: 00000000-00006688), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID:\
      \ 00000000-00001576), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID: 00000000-00004756)"
  - EventData: Spawns new processes
  - EventData: target-25
  - EventData: "Process \"msedge.exe\" (UID: 00000000-00004808) was launched with\
      \ missing environment variables: \"CHROME_RESTART, EDGE_METRICS_SESSION_ID,\
      \ EDGE_USER_DATA_DIR, CHROME_CRASHPAD_PIPE_NAME, PROCESSOR_ARCHITEW6432, EDGE_BROWSER_PID,\
      \ EDGE_VARIATIONS_SEED_ETAG, EDGE_METRICS_CLIENT_ID_HASH\"\n Process \"msedge.exe\"\
      \ (UID: 00000000-00006672) was launched with new environment variables: \"CHROME_CRASHPAD_PIPE_NAME=\"\
      \\\\.\\pipe\\LOCAL\\crashpad_4808_UTVMBXHKFJJBYKGF\", EDGE_BROWSER_PID=\"4808\"\
      \"\n Process \"msedge.exe\" (UID: 00000000-00004088) was launched with new environment\
      \ variables: \"EDGE_METRICS_SESSION_ID=\"29\", EDGE_USER_DATA_DIR=\"%LOCALAPPDATA%\\\
      Microsoft\\Edge\\User Data\", EDGE_VARIATIONS_SEED_ETAG=\"\"uiIxlFHEqYK/kbVuiEU5CgZajeU9QmL4/F97KjHfTZw=\"\
      \", EDGE_METRICS_CLIENT_ID_HASH=\"-5815550854748070847\"\"\n Process \"msedge.exe\"\
      \ (UID: 00000000-00007036) was launched with new environment variables: \"CHROME_RESTART=\"\
      Microsoft Edge|Microsoft Edge has stopped working. Restart it?|LEFT_TO_RIGHT\"\
      \""
  - EventData: Process launched with changed environment
  - EventData: target-67
  - EventData: Spawns new processes that are not known child processes
  - EventData: target-103
  - EventData: "\"144.172.105.157:443\"\n \"198.35.26.96:443\"\n \"208.80.154.240:443\"\
      \n \"208.80.154.224:443\""
  - EventData: Contacts server
  - EventData: network-1
  - EventData: '"gcsurfaces.steris.psychplus.help"'
  - EventData: Contacts domains
  - EventData: network-0
  - EventData: "\"en.wikipedia.org\"\n \"gcsurfaces.steris.psychplus.help\"\n \"upload.wikimedia.org\"\
      \n \"www.wikipedia.org\""
  - EventData: Queries DNS server
  - EventData: network-51
  - EventData: 'External resources discovered in HTML content:

      www.wikipedia.org | href | script_content'
  - EventData: Identifies external resources in HTML content
  - EventData: binary-8602
  - EventData: '"urlref_httpsgcsurfaces.steris.psychplus.helpf5968f5d6c7d1" has type
      "HTML document ASCII text with no line terminators"- [targetUID: N/A]'
  - EventData: Dropped files
  - EventData: binary-0
  - EventData: "Pattern match: \"https://gcsurfacessteris.psychplus\"\n Pattern match:\
      \ \"https://gcsurfaces.steris.psychplus.help/f/5968f5d6c7d1\"\n Pattern match:\
      \ \"https://gcsurfaces.steris.psychplus.help\"\n Pattern match: \"https://www.wikipedia.org\"\
      \n Pattern match: \"www.wikipedia.org\"\n Heuristic match: \"en.wikipedia.org\"\
      \n Heuristic match: \"upload.wikimedia.org\""
  - EventData: Found potential URL in binary/memory
  - EventData: string-3
  - EventData: "Short term registered certificate: \"en.wikipedia.org\" (89 days old)\n\
      \ Short term registered certificate: \"gcsurfaces.steris.psychplus.help\" (89\
      \ days old)\n Short term registered certificate: \"upload.wikimedia.org\" (89\
      \ days old)\n Short term registered certificate: \"www.wikipedia.org\" (89 days\
      \ old)"
  - EventData: Short-term SSL certificate detected
  - EventData: certificate-3
  - EventData: 'Newly renewed or created SSL certificate: "gcsurfaces.steris.psychplus.help"
      (1 days old)'
  - EventData: Recently renewed or created SSL certificate
  - EventData: certificate-4
  - EventData: Found http requests in header "GET /f/5968f5d6c7d1"
  - EventData: Communicates with HTTP webserver (GET/POST requests)
  - EventData: network-62
  - EventData: "Contacted domain: \"gcsurfaces.steris.psychplus.help\" has high entropy\n\
      \ Contacted domain: \"upload.wikimedia.org\" has high entropy"
  - EventData: High entropy domain detected
  - EventData: network-81
  - EventData: "\"GET /f/5968f5d6c7d1 HTTP/1.1\nHost: gcsurfaces.steris.psychplus.help\n\
      Connection: keep-alive\nsec-ch-ua: \"Microsoft Edge\";v=\"107\", \"Chromium\"\
      ;v=\"107\", \"Not=A?Brand\";v=\"24\"\nsec-ch-ua-mobile: ?0\nsec-ch-ua-platform:\
      \ \"Windows\"\nUpgrade-Insecure-Requests: 1\nUser-Agent: Mozilla/5.0 (Windows\
      \ NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0\
      \ Safari/537.36 Edg/107.0.1418.56\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9\n\
      Sec-Fetch-Site: none\nSec-Fetch-Mode: navigate\nSec-Fetch-User: ?1\nSec-Fetch-Dest:\
      \ document\nAccept-Encoding: gzip, deflate, br\nAccept-Language: en-US,en;q=0.9\"\
      \ Response ==> HTTP/1.1 200 OK\nAlt-Svc: h3=\":443\"; ma=86400\nCache-Control:\
      \ no-cache\n no-store\nConnection: close\nContent-Type: text/html\nTransfer-Encoding:\
      \ chunked with response body ==>3C68746D6C3E3C686561643E3C6D657461206E616D653D2772656665727265722720636F6E74656E743D276E6F2D7265666572726572273E3C7363726970743E......."
  - EventData: GETs files from a webserver
  - EventData: network-61
  - EventData: 'Suspicious redirect patterns detected:


      Redirect Types: Location Redirect


      Redirects to: https://www.wikipedia.org


      Suspicious Redirect (Location Redirect):

      location.href=''https://www.wikipedia.org'''
  - EventData: HTML contains suspicious external redirect patterns
  - EventData: binary-8607
  - EventData: Drops powershell script files
  - EventData: binary-42
  - EventData: 'Recently Registered domain detected: "psychplus.help" (2 days old).
      Commonly seen with phishing or other suspicious domains'
  - EventData: Recently registered domain detected
  - EventData: network-8601
  - EventData: 'SUBMITTED URL: "https://gcsurfaces.steris.psychplus.help/f/5968f5d6c7d1"
      contacted related malicious domain: "psychplus.help"'
  - EventData: Malicious domain detected
  - EventData: network-85
  selection_network:
  - DestinationHostname: en.wikipedia.org
  - DestinationHostname: gcsurfaces.steris.psychplus.help
  - DestinationHostname: upload.wikimedia.org
  - DestinationHostname: www.wikipedia.org
  - DestinationIp: 107.0.0.0
  - DestinationIp: 144.172.105.157
  - DestinationIp: 198.35.26.96
  - DestinationIp: 208.80.154.224
  - DestinationIp: 208.80.154.240
  condition: selection_behavior or selection_network
