title: proximity behavior detection (efc7d9c8)
id: efc7d9c8980a6d99806676e3eb24ab0906d05cc674928c4d2648837c7170a4bc
status: experimental
description: Auto-generated Sigma rule for proximity
logsource:
  product: windows
  service: sysmon
detection:
  selection_behavior:
  - EventData: "Spawned process \"msedge.exe\" with commandline \"--single-argument\
      \ http://concrete.co.jp/\" (UID: 00000000-00006160)\n Spawned process \"msedge.exe\"\
      \ with commandline \"--type=crashpad-handler \"--user-data-dir=%LOCALAPPDATA%\\\
      \\Microso ...\" (UID: 00000000-00000200), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=gpu-process --gpu-preferences=UAAAAAAAAADgAAAYAAAAAAAAAAA\
      \ ...\" (UID: 00000000-00007356), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=network.mojom.NetworkService - ...\" (UID:\
      \ 00000000-00005608), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=storage.mojom.StorageService - ...\" (UID: 00000000-00007928),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=renderer --display-capture-permissions-policy-allowed\
      \ --j ...\" (UID: 00000000-00001044), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=renderer --display-capture-permissions-policy-allowed --j ...\" (UID:\
      \ 00000000-00003184), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=asset_store.mojom.AssetStoreSe ...\" (UID: 00000000-00006400),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=data_decoder.mojom.DataDecoder\
      \ ...\" (UID: 00000000-00002664), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=data_decoder.mojom.DataDecoder ...\" (UID:\
      \ 00000000-00001248), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=data_decoder.mojom.DataDecoder ...\" (UID: 00000000-00006892),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper\
      \ --lang=en ...\" (UID: 00000000-00004372), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en\
      \ ...\" (UID: 00000000-00006380), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID:\
      \ 00000000-00004968), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID: 00000000-00003568),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=gpu-process --disable-gpu-sandbox\
      \ --use-gl=disabled --gpu ...\" (UID: 00000000-00004280), Spawned process \"\
      msedge.exe\" with commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper\
      \ --lang=en ...\" (UID: 00000000-00007976), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en\
      \ ...\" (UID: 00000000-00005404), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID:\
      \ 00000000-00005316), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID: 00000000-00000584),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper\
      \ --lang=en ...\" (UID: 00000000-00004184), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en\
      \ ...\" (UID: 00000000-00007800), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID:\
      \ 00000000-00005200), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID: 00000000-00001848),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=data_decoder.mojom.DataDecoder\
      \ ...\" (UID: 00000000-00001808)"
  - EventData: Spawns new processes that are not known child processes
  - EventData: target-103
  - EventData: "Process \"msedge.exe\" (UID: 00000000-00006160) was launched with\
      \ new environment variables: \"USERDNSDOMAIN=\"DESKTOP-FVVF82A\"\"\n Process\
      \ \"msedge.exe\" (UID: 00000000-00006160) was launched with modified environment\
      \ variables: \"PROCESSOR_ARCHITECTURE, CommonProgramFiles, Path, ProgramFiles,\
      \ NUMBER_OF_PROCESSORS\"\n Process \"msedge.exe\" (UID: 00000000-00006160) was\
      \ launched with missing environment variables: \"PROCESSOR_ARCHITEW6432\"\n\
      \ Process \"msedge.exe\" (UID: 00000000-00000200) was launched with new environment\
      \ variables: \"CHROME_CRASHPAD_PIPE_NAME=\"\\\\.\\pipe\\LOCAL\\crashpad_6160_BSWBJOWJGCGLHQWA\"\
      , EDGE_BROWSER_PID=\"6160\"\"\n Process \"msedge.exe\" (UID: 00000000-00007356)\
      \ was launched with new environment variables: \"EDGE_METRICS_SESSION_ID=\"\
      29\", EDGE_USER_DATA_DIR=\"%LOCALAPPDATA%\\Microsoft\\Edge\\User Data\", EDGE_VARIATIONS_SEED_ETAG=\"\
      \"uiIxlFHEqYK/kbVuiEU5CgZajeU9QmL4/F97KjHfTZw=\"\", EDGE_METRICS_CLIENT_ID_HASH=\"\
      -5815550854748070847\"\"\n Process \"msedge.exe\" (UID: 00000000-00005608) was\
      \ launched with new environment variables: \"CHROME_RESTART=\"Microsoft Edge|Microsoft\
      \ Edge has stopped working. Restart it?|LEFT_TO_RIGHT\"\""
  - EventData: Process launched with changed environment
  - EventData: target-67
  - EventData: Spawns new processes
  - EventData: target-25
  - EventData: '"133.130.127.214:80"'
  - EventData: Contacts server
  - EventData: network-1
  - EventData: '"concrete.co.jp"'
  - EventData: Contacts domains
  - EventData: network-0
  - EventData: '"GET /favicon.ico HTTP/1.1

      Host: concrete.co.jp

      Connection: keep-alive

      User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
      like Gecko) Chrome/107.0.0.0 Safari/537.36 Edg/107.0.1418.56

      Accept: image/webp,image/apng,image/svg+xml,image/*,*/*;q=0.8

      Referer: http://concrete.co.jp/index.php

      Accept-Encoding: gzip, deflate

      Accept-Language: en-US,en;q=0.9"'
  - EventData: Tries to GET non-existent files from a webserver
  - EventData: network-3
  - EventData: Queries DNS server
  - EventData: network-51
  - EventData: "Pattern match: \"concrete.cojp/index.php\"\n Pattern match: \"http://concrete.co.jp/\"\
      \n Pattern match: \"http://concrete.co.jp\"\n Heuristic match: \"concrete.co.jp\"\
      \n Pattern match: \"http://concrete.co.jp/index.phpaccept-encoding\""
  - EventData: Found potential URL in binary/memory
  - EventData: string-3
  - EventData: "Found http requests in header \"GET /\"\n Found http requests in header\
      \ \"GET /favicon.ico\""
  - EventData: Communicates with HTTP webserver (GET/POST requests)
  - EventData: network-62
  - EventData: "\"GET / HTTP/1.1\nHost: concrete.co.jp\nConnection: keep-alive\nUpgrade-Insecure-Requests:\
      \ 1\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36\
      \ (KHTML, like Gecko) Chrome/107.0.0.0 Safari/537.36 Edg/107.0.1418.56\nAccept:\
      \ text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9\n\
      Accept-Encoding: gzip, deflate\nAccept-Language: en-US,en;q=0.9\" Response ==>\
      \ HTTP/1.1 302 Found\nDate: Thu\n 12 Feb 2026 02:53:47 GMT\nServer: Apache\n\
      Location: index.php\nX-XSS-Protection: 1; mode=block\nContent-Length: 0\nKeep-Alive:\
      \ timeout=15\n max=100\nConnection: Keep-Alive\nContent-Type: text/html with\
      \ no response body\n \"GET /favicon.ico HTTP/1.1\nHost: concrete.co.jp\nConnection:\
      \ keep-alive\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36\
      \ (KHTML, like Gecko) Chrome/107.0.0.0 Safari/537.36 Edg/107.0.1418.56\nAccept:\
      \ image/webp,image/apng,image/svg+xml,image/*,*/*;q=0.8\nReferer: http://concrete.co.jp/index.php\n\
      Accept-Encoding: gzip, deflate\nAccept-Language: en-US,en;q=0.9\" Response ==>\
      \ HTTP/1.1 404 Not Found\nDate: Thu\n 12 Feb 2026 02:53:47 GMT\nServer: Apache\n\
      Content-Length: 209\nKeep-Alive: timeout=15\n max=100\nConnection: Keep-Alive\n\
      Content-Type: text/html; charset=iso-8859-1 with response body ==>3C21444F43545950452048544D4C205055424C494320222D2F2F494554462F2F4454442048544D4C20322E302F2F454E223E0A3C68746D6C3E3C686561643E0A......."
  - EventData: GETs files from a webserver
  - EventData: network-61
  - EventData: 'SUBMITTED URL: "http://concrete.co.jp/" contacted related malicious
      domain: "concrete.co.jp"'
  - EventData: Malicious domain detected
  - EventData: network-85
  selection_network:
  - DestinationHostname: concrete.co.jp
  - DestinationHostname: favicon.ico
  - DestinationHostname: index.php
  - DestinationIp: 107.0.0.0
  - DestinationIp: 133.130.127.214
  condition: selection_behavior or selection_network
