title: Lazy.Generic malware detection
id: Lazy.Gen-39b76c1f
status: experimental
description: Detects Lazy.Generic malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains registry location strings
  - EventType: Contains ability to create a new process (API string)
  - EventType: Loads the Bcrypt module DLL
  - EventType: Creates mutants
  - EventType: PE file has a high image base
  - EventType: PE file entrypoint instructions
  - EventType: Able to create/load registry keys (API string)
  - EventType: Contains ability to execute Windows APIs
  - DestinationHostname: pee-files.nl
  - DestinationIp: 104.21.84.179
  condition: selection
tags:
- malware
- Lazy.Generic
