title: Trojan.Agent malware detection
id: Trojan.A-234d37f6
status: experimental
description: Detects Trojan.Agent malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Found E-Mail address in binary/memory
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to impersonate another user on the local machine (API
      string)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to execute an application (API string)
  - EventType: Contains registry location strings
  - EventType: Can load assembly that contains the code that is currently executing
      (Dotnet)
  - EventType: Loads the Bcrypt module DLL
  - DestinationHostname: vaibaht.com
  condition: selection
tags:
- malware
- Trojan.Agent
