title: Trojan.Agent malware detection
id: Trojan.A-922a0f7f
status: experimental
description: Detects Trojan.Agent malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to create/open files (API string)
  - EventType: Able to retrieve command line parameters of the running process
  - EventType: Contains registry location strings
  - EventType: Found E-Mail address in binary/memory
  - EventType: Contains ability to execute Windows APIs
  - EventType: Contains ability to find and load resources of specific modules (API
      string)
  - EventType: Contains ability to set/get the last-error code for a calling thread
      (API string)
  - EventType: References Windows file paths for DLLs (possible dropped files)
  - EventType: Contains PDB pathways
  - EventType: Observed Powershell command strings
  - DestinationHostname: batyatj6.beget.tech
  condition: selection
tags:
- malware
- Trojan.Agent
