title: unknown malware detection
id: unknown-61b76b7b
status: experimental
description: Detects unknown malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains reference to licensed c/c++ library
  - EventType: Able to retrieve command line parameters of the running process
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains registry location strings
  - EventType: Loads the Bcrypt module DLL
  - EventType: Contains ability to execute Windows APIs
  - EventType: Creates mutants
  - EventType: Contains ability to retrieve/modify process thread (API string)
  condition: selection
tags:
- malware
- unknown
