title: unknown malware detection
id: unknown-b967112e
status: experimental
description: Detects unknown malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Loads the Bcrypt module DLL
  - EventType: Creates mutants
  - EventType: Overview of unique CLSIDs touched in registry
  - EventType: References Windows file paths for DLLs (possible dropped files)
  - EventType: Loads the RPC (Remote Procedure Call) module DLL
  - EventType: Loads the CLR Loader DLL
  - EventType: Loads modules at runtime
  - EventType: Calls an API typically used to load libraries
  - EventType: Reads information about supported languages
  - EventType: Spawns new processes that are not known child processes
  condition: selection
tags:
- malware
- unknown
