title: IL_Trojan.MSILZilla malware detection
id: IL_Troja-6461d2ad
status: experimental
description: Detects IL_Trojan.MSILZilla malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to execute an application (API string)
  - EventType: Can load assembly that contains the code that is currently executing
      (Dotnet)
  - EventType: Contains registry location strings
  - EventType: Contains ability to execute Windows APIs
  - EventType: Contains ability to retrieve/open a process (API string)
  - EventType: Able to execute applications using .NET process API
  - EventType: References Windows file paths for DLLs (possible dropped files)
  - EventType: Possibly uses system binaries (Windows LOLbins)
  - EventType: Contains SQL queries
  - EventType: Found registry location strings in memory
  - DestinationHostname: larenxzose-39663.portmap.host
  - DestinationIp: 193.161.193.99
  condition: selection
tags:
- malware
- IL_Trojan.MSILZilla
