title: new_domain malware detection
id: new_doma-363dc788
status: experimental
description: Detects new_domain malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: The input sample is signed with a certificate
  - EventType: Process launched with changed environment
  - EventType: Spawns new processes that are not known child processes
  - EventType: Spawns new processes
  - EventType: Contacts server
  - EventType: Contacts domains
  - EventType: Tries to GET non-existent files from a webserver
  - EventType: Queries DNS server
  - EventType: Identifies external resources in HTML content
  - EventType: Dropped files
  - DestinationHostname: a.nel.cloudflare.com
  - DestinationHostname: cdnjs.cloudflare.com
  - DestinationHostname: connect.holecompany.info
  - DestinationHostname: makfile.s3.us-east-1.amazonaws.com
  - DestinationHostname: stackpath.bootstrapcdn.com
  - DestinationHostname: static.cloudflareinsights.com
  - DestinationHostname: trickflag.info
  - DestinationIp: 194.54.164.123
  - DestinationIp: 104.21.9.245
  - DestinationIp: 104.16.79.73
  - DestinationIp: 104.18.11.207
  - DestinationIp: 104.21.9.245
  condition: selection
tags:
- malware
- new_domain
