title: new_domain behavior detection (d3669f45)
id: d3669f4593b5b5763fb23b3e88f04db62425951aa5eeec97784cc48cd4885c3b
status: experimental
description: Auto-generated Sigma rule for new_domain
logsource:
  product: windows
  service: sysmon
detection:
  selection_behavior:
  - EventData: "The input sample is signed with a certificate issued by \"CN=WR3,\
      \ O=Google Trust Services, C=US\" (SHA1: AF:EC:E5:E3:76:0B:70:D0:3E:63:56:25:1D:0E:57:67:3C:42:5A:91;\
      \ see report for more information)\n The input sample is signed with a certificate\
      \ issued by \"CN=GTS Root R1, O=Google Trust Services LLC, C=US\" (SHA1: E2:51:CB:7D:AF:59:31:04:5A:80:45:45:A0:F4:5B:C2:26:A0:BD:76;\
      \ see report for more information)\n The input sample is signed with a certificate\
      \ issued by \"CN=GlobalSign Root CA, OU=Root CA, O=GlobalSign nv-sa, C=BE\"\
      \ (SHA1: 08:74:54:87:E8:91:C1:9E:30:78:C1:F2:A0:7E:45:29:50:EF:36:F6; see report\
      \ for more information)\n The input sample is signed with a certificate issued\
      \ by \"CN=GlobalSign Atlas R3 DV TLS CA 2025 Q3, O=GlobalSign nv-sa, C=BE\"\
      \ (SHA1: 46:28:F0:69:6F:53:FC:9F:BA:6A:73:37:D0:D7:C8:87:AE:06:47:7A; see report\
      \ for more information)\n The input sample is signed with a certificate issued\
      \ by \"CN=GlobalSign, O=GlobalSign, OU=GlobalSign Root CA - R3\" (SHA1: AD:94:DF:2C:8F:AC:1F:B5:A0:73:4F:5E:81:0E:57:B6:C2:CE:92:91;\
      \ see report for more information)\n The input sample is signed with a certificate\
      \ issued by \"CN=WE1, O=Google Trust Services, C=US\" (SHA1: 14:F5:0D:48:B7:90:E2:11:A0:E5:CF:C2:4C:57:9C:ED:C7:EC:D7:6C;\
      \ see report for more information)\n The input sample is signed with a certificate\
      \ issued by \"CN=GTS Root R4, O=Google Trust Services LLC, C=US\" (SHA1: 10:8F:BF:79:4E:18:EC:53:47:A4:14:E4:37:0C:C4:50:6C:29:7A:B2;\
      \ see report for more information)\n The input sample is signed with a certificate\
      \ issued by \"CN=GlobalSign Root CA, OU=Root CA, O=GlobalSign nv-sa, C=BE\"\
      \ (SHA1: 93:2B:ED:33:9A:A6:92:12:C8:93:75:B7:93:04:B4:75:49:0B:89:A0; see report\
      \ for more information)\n The input sample is signed with a certificate issued\
      \ by \"CN=WE1, O=Google Trust Services, C=US\" (SHA1: C6:6A:71:84:C2:40:13:D1:A4:B7:DF:C4:1C:E1:54:F3:76:97:EF:6B;\
      \ see report for more information)"
  - EventData: The input sample is signed with a certificate
  - EventData: certificate-0
  - EventData: "Process \"msedge.exe\" (UID: 00000000-00002932) was launched with\
      \ new environment variables: \"USERDNSDOMAIN=\"DESKTOP-FVVF82A\"\"\n Process\
      \ \"msedge.exe\" (UID: 00000000-00002932) was launched with modified environment\
      \ variables: \"PROCESSOR_ARCHITECTURE, CommonProgramFiles, Path, ProgramFiles,\
      \ NUMBER_OF_PROCESSORS\"\n Process \"msedge.exe\" (UID: 00000000-00002932) was\
      \ launched with missing environment variables: \"PROCESSOR_ARCHITEW6432\"\n\
      \ Process \"msedge.exe\" (UID: 00000000-00006380) was launched with new environment\
      \ variables: \"CHROME_CRASHPAD_PIPE_NAME=\"\\\\.\\pipe\\LOCAL\\crashpad_2932_YSPGEYGFSOXMEOOS\"\
      , EDGE_BROWSER_PID=\"2932\"\"\n Process \"msedge.exe\" (UID: 00000000-00000704)\
      \ was launched with new environment variables: \"EDGE_METRICS_SESSION_ID=\"\
      29\", EDGE_USER_DATA_DIR=\"%LOCALAPPDATA%\\Microsoft\\Edge\\User Data\", EDGE_VARIATIONS_SEED_ETAG=\"\
      \"uiIxlFHEqYK/kbVuiEU5CgZajeU9QmL4/F97KjHfTZw=\"\", EDGE_METRICS_CLIENT_ID_HASH=\"\
      -5815550854748070847\"\"\n Process \"msedge.exe\" (UID: 00000000-00001676) was\
      \ launched with new environment variables: \"CHROME_RESTART=\"Microsoft Edge|Microsoft\
      \ Edge has stopped working. Restart it?|LEFT_TO_RIGHT\"\""
  - EventData: Process launched with changed environment
  - EventData: target-67
  - EventData: "Spawned process \"msedge.exe\" with commandline \"--single-argument\
      \ https://revenue.fizice.com/\" (UID: 00000000-00002932)\n Spawned process \"\
      msedge.exe\" with commandline \"--type=crashpad-handler \"--user-data-dir=%LOCALAPPDATA%\\\
      \\Microso ...\" (UID: 00000000-00006380), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=gpu-process --gpu-preferences=UAAAAAAAAADgAAAYAAAAAAAAAAA\
      \ ...\" (UID: 00000000-00000704), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=network.mojom.NetworkService - ...\" (UID:\
      \ 00000000-00001676), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=storage.mojom.StorageService - ...\" (UID: 00000000-00006192),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=renderer --display-capture-permissions-policy-allowed\
      \ --j ...\" (UID: 00000000-00004024), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=renderer --display-capture-permissions-policy-allowed --j ...\" (UID:\
      \ 00000000-00008040), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=asset_store.mojom.AssetStoreSe ...\" (UID: 00000000-00004488),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=data_decoder.mojom.DataDecoder\
      \ ...\" (UID: 00000000-00003228), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=data_decoder.mojom.DataDecoder ...\" (UID:\
      \ 00000000-00006624), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=data_decoder.mojom.DataDecoder ...\" (UID: 00000000-00008088),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper\
      \ --lang=en ...\" (UID: 00000000-00004320), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en\
      \ ...\" (UID: 00000000-00005220), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID:\
      \ 00000000-00006320), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID: 00000000-00004216),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=gpu-process --disable-gpu-sandbox\
      \ --use-gl=disabled --gpu ...\" (UID: 00000000-00007212), Spawned process \"\
      msedge.exe\" with commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper\
      \ --lang=en ...\" (UID: 00000000-00006992), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en\
      \ ...\" (UID: 00000000-00007828), Spawned process \"msedge.exe\" with commandline\
      \ \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID:\
      \ 00000000-00001764), Spawned process \"msedge.exe\" with commandline \"--type=utility\
      \ --utility-sub-type=unzip.mojom.Unzipper --lang=en ...\" (UID: 00000000-00005040),\
      \ Spawned process \"msedge.exe\" with commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper\
      \ --lang=en ...\" (UID: 00000000-00004284), Spawned process \"msedge.exe\" with\
      \ commandline \"--type=utility --utility-sub-type=unzip.mojom.Unzipper --lang=en\
      \ ...\" (UID: 00000000-00006016)"
  - EventData: Spawns new processes that are not known child processes
  - EventData: target-103
  - EventData: Spawns new processes
  - EventData: target-25
  - EventData: "\"172.67.163.37:443\"\n \"35.190.80.1:443\"\n \"151.101.130.208:443\"\
      \n \"104.16.79.73:443\""
  - EventData: Contacts server
  - EventData: network-1
  - EventData: "\"a.nel.cloudflare.com\"\n \"images.unsplash.com\"\n \"revenue.fizice.com\"\
      \n \"static.cloudflareinsights.com\""
  - EventData: Queries DNS server
  - EventData: network-51
  - EventData: "Pattern match: \"https://revenue.fizice.com/\"\n Pattern match: \"\
      https://revenue.fizice.com\"\n Heuristic match: \"a.nel.cloudflare.com\"\n Heuristic\
      \ match: \"images.unsplash.com\"\n Heuristic match: \"revenue.fizice.com\"\n\
      \ Heuristic match: \"static.cloudflareinsights.com\""
  - EventData: Found potential URL in binary/memory
  - EventData: string-3
  - EventData: "Short term registered certificate: \"a.nel.cloudflare.com\" (90 days\
      \ old)\n Short term registered certificate: \"revenue.fizice.com\" (90 days\
      \ old)\n Short term registered certificate: \"static.cloudflareinsights.com\"\
      \ (90 days old)"
  - EventData: Short-term SSL certificate detected
  - EventData: certificate-3
  - EventData: "Contacted domain: \"images.unsplash.com\" has high entropy\n Contacted\
      \ domain: \"static.cloudflareinsights.com\" has high entropy"
  - EventData: High entropy domain detected
  - EventData: network-81
  - EventData: 'Recently Registered domain detected: "fizice.com" (28 days old). Commonly
      seen with phishing or other suspicious domains'
  - EventData: Recently registered domain detected
  - EventData: network-8600
  - EventData: 'SUBMITTED URL: "https://revenue.fizice.com/" contacted related malicious
      domain: "fizice.com"'
  - EventData: Malicious domain detected
  - EventData: network-85
  selection_network:
  - DestinationHostname: a.nel.cloudflare.com
  - DestinationHostname: images.unsplash.com
  - DestinationHostname: revenue.fizice.com
  - DestinationHostname: static.cloudflareinsights.com
  - DestinationIp: 104.16.79.73
  - DestinationIp: 151.101.130.208
  - DestinationIp: 172.67.163.37
  - DestinationIp: 35.190.80.1
  condition: selection_behavior or selection_network
