title: Win64_Agent_AGeneric.KNB_trojan malware detection
id: Win64_Ag-bb71ece4
status: experimental
description: Detects Win64_Agent_AGeneric.KNB_trojan malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains registry location strings
  - EventType: Loads the Bcrypt module DLL
  - EventType: Creates mutants
  - EventType: PE file has a high image base
  - EventType: PE file entrypoint instructions
  - EventType: Contains ability to set/get the last-error code for a calling thread
      (API string)
  - EventType: Loads modules at runtime
  - EventType: Calls an API typically used to load libraries
  - EventType: Loads the RPC (Remote Procedure Call) module DLL
  - DestinationHostname: api.valentinesforever.thm
  - DestinationHostname: testmycdn.azureedge.net
  condition: selection
tags:
- malware
- Win64_Agent_AGeneric.KNB_trojan
