title: Tedy.Generic malware detection
id: Tedy.Gen-023a9e0f
status: experimental
description: Detects Tedy.Generic malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to execute an application (API string)
  - EventType: Contains ability to execute Windows APIs
  - EventType: Contains ability to retrieve/open a process (API string)
  - EventType: Able to create/load registry keys (API string)
  - EventType: Found E-Mail address in binary/memory
  - EventType: Able to rename or move file/directory (API string)
  - DestinationHostname: parse.lxown.com
  - DestinationIp: 61.241.148.77
  condition: selection
tags:
- malware
- Tedy.Generic
