title: giant.midie.Generic malware detection
id: giant.mi-c21b1e4d
status: experimental
description: Detects giant.midie.Generic malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains registry location strings
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to execute Windows APIs
  - EventType: Found named pipe like strings
  - EventType: References JavaScript(s)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains ability to retrieve/modify process thread (API string)
  - EventType: Contains ability to retrieve/open a process (API string)
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to create a new process (API string)
  condition: selection
tags:
- malware
- giant.midie.Generic
