title: Linux.Mirai behavior detection (a64f31e7)
id: a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82
status: experimental
description: Auto-generated Sigma rule for Linux.Mirai
logsource:
  product: windows
  service: sysmon
detection:
  selection_behavior:
  - EventData: "Calls a syscall: \"procexit\"\n Calls a syscall: \"execve\"\n Calls\
      \ a syscall: \"ioctl\"\n Calls a syscall: \"rt_sigprocmask\"\n Calls a syscall:\
      \ \"rt_sigaction\"\n Calls a syscall: \"socket\"\n Calls a syscall: \"connect\"\
      \n Calls a syscall: \"getsockname\"\n Calls a syscall: \"close\"\n Calls a syscall:\
      \ \"brk\""
  - EventData: Calls native functions (syscalls)
  - EventData: api-1150
  - EventData: a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin
      is stripped
  - EventData: Binary is stripped
  - EventData: static-1000
  - EventData: "file/memory contains long string with (Indicator: \"accept\"; File:\
      \ \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\")\n\
      \ file/memory contains long string with (Indicator: \"connect\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Invalid cross-device link\" (Indicator: \"link\"\
      ; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Too many open files in system\" (Indicator: \"\
      open\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Too many open files\" (Indicator: \"open\"; File:\
      \ \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\")\n\
      \ Found reference to API \"Inappropriate ioctl for device\" (Indicator: \"ioctl\"\
      ; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Read-only file system\" (Indicator: \"read\"; File:\
      \ \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\")\n\
      \ Found reference to API \"Too many links\" (Indicator: \"link\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Broken pipe\" (Indicator: \"pipe\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Too many levels of symbolic links\" (Indicator:\
      \ \"link\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Level 2 not synchronized\" (Indicator: \"sync\"\
      ; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Link number out of range\" (Indicator: \"link\"\
      ; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Timer expired\" (Indicator: \"time\"; File: \"\
      a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\")\n Found\
      \ reference to API \"Link has been severed\" (Indicator: \"link\"; File: \"\
      a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\")\n Found\
      \ reference to API \"Srmount error\" (Indicator: \"mount\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"File descriptor in bad state\" (Indicator: \"stat\"\
      ; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Can not access a needed shared library\" (Indicator:\
      \ \"access\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Accessing a corrupted shared library\" (Indicator:\
      \ \"access\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Attempting to link in too many shared libraries\"\
      \ (Indicator: \"link\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Streams pipe error\" (Indicator: \"pipe\"; File:\
      \ \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\")\n\
      \ Found reference to API \"Socket operation on non-socket\" (Indicator: \"socket\"\
      ; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Protocol wrong type for socket\" (Indicator: \"\
      socket\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Socket type not supported\" (Indicator: \"socket\"\
      ; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Address already in use\" (Indicator: \"read\";\
      \ File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Network dropped connection on reset\" (Indicator:\
      \ \"connect\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )\n Found reference to API \"Software caused connection abort\" (Indicator:\
      \ \"connect\"; File: \"a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin\"\
      )"
  - EventData: Contains native function calls (syscalls strings)
  - EventData: string-5000
  - EventData: 'Heuristic match: "example.com"'
  - EventData: Found potential URL in binary/memory
  - EventData: string-3
  - EventData: '/home/ubuntu/a64f31e75e1.bin executed: getsockname'
  - EventData: Calls a system call typically used to retrieve the current address
      to which the socket is bound
  - EventData: api-1152
  - EventData: Potential IP "158.94.210.195" found in string "M-158.94.210.195"
  - EventData: Found potential IP address in binary/memory
  - EventData: string-14
  - EventData: a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin
      is statically linked
  - EventData: Binary is statically linked
  - EventData: static-1001
  - EventData: 11/26 Antivirus vendors marked sample as malicious (42% detection rate)
  - EventData: Sample was identified as malicious by at least one Antivirus engine
  - EventData: avtest-0
  - EventData: 'YARA signature "elf_mirai_x86_g1" classified file "sample.bin" as
      "mirai,botnet" (Author: Daniel Plohmann <daniel.plohmann<at>fkie.fraunhofer.de>,
      Thorsten Jenke <thorsten.jenke<at>fkie.fraunhofer.de>)'
  - EventData: YARA signature match
  - EventData: yara-0
  - EventData: a64f31e75e1f738f2232f1356c3171ec3abe6aef1b004988173730449b561f82.bin
      section headers are modified/stripped
  - EventData: Section headers are modified/stripped
  - EventData: static-1004
  - EventData: The binary has been stripped of all debug symbols and its shared objects
      are also statically linked to the binary
  - EventData: The binary is stripped and also statically linked
  - EventData: summary-1000
  - EventData: Sample was identified as malicious by a large number of Antivirus engines
  - EventData: avtest-3
  - EventData: 'CrowdStrike Static Analysis and ML (QuickScan) yielded detection:
      linux/malicious_confidence_100% (W)'
  - EventData: Sample detected by CrowdStrike Static Analysis and ML with relatively
      high confidence
  - EventData: avtest-8
  - EventData: No specific details available
  - EventData: Sample was identified as malicious by a trusted Antivirus engine
  - EventData: avtest-5
  selection_network: []
  condition: selection_behavior or selection_network
