title: Genie.8DN.Generic malware detection
id: Genie.8D-43c461a4
status: experimental
description: Detects Genie.8DN.Generic malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains registry location strings
  - EventType: Can load assembly that contains the code that is currently executing
      (Dotnet)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to execute Windows APIs
  - EventType: Contains PDB pathways
  - EventType: References Windows file paths for DLLs (possible dropped files)
  - EventType: Found registry location strings in memory
  condition: selection
tags:
- malware
- Genie.8DN.Generic
