title: Win_malicious_confidence_60_ malware detection
id: Win_mali-1a03bcff
status: experimental
description: Detects Win_malicious_confidence_60_ malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains ability to execute Windows APIs
  - EventType: Found well known domains (string)
  - EventType: Contains ability to set/get the last-error code for a calling thread
      (API string)
  - EventType: Contains registry location strings
  - EventType: Contains ability to retrieve/open a process (API string)
  - EventType: Able to rename or move file/directory (API string)
  condition: selection
tags:
- malware
- Win_malicious_confidence_60_
