title: evasive malware detection
id: evasive-bdedc135
status: experimental
description: Detects evasive malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to execute Windows APIs
  - EventType: Able to create/load registry keys (API string)
  - EventType: Contains ability to execute an application (API string)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains registry location strings
  - EventType: Contains ability to show a graphical window (API string)
  - EventType: Can load assembly that contains the code that is currently executing
      (Dotnet)
  - DestinationHostname: analyticsnew.overwolf.com
  - DestinationHostname: console-apps.overwolf.com
  - DestinationHostname: content.overwolf.com
  - DestinationHostname: features.overwolf.com
  - DestinationHostname: fonts.googleapis.com
  - DestinationHostname: fonts.gstatic.com
  - DestinationHostname: storeapi.overwolf.com
  - DestinationIp: 3.170.185.75
  - DestinationIp: 18.154.185.87
  - DestinationIp: 3.170.152.20
  - DestinationIp: 3.168.51.41
  - DestinationIp: 18.154.185.91
  condition: selection
tags:
- malware
- evasive
