title: evasive malware detection
id: evasive-bec9fe3c
status: experimental
description: Detects evasive malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to executes commands or batch file
  - EventType: Contains registry location strings
  - EventType: Contains ability to set/get the last-error code for a calling thread
      (API string)
  - EventType: Found E-Mail address in binary/memory
  - EventType: Contains ability to create/control drivers (API string)
  - EventType: Contains SQL queries
  - EventType: References Windows file paths for DLLs (possible dropped files)
  - EventType: Contains ability to start a process (Powershell command string)
  - DestinationHostname: vcc-library.uk
  condition: selection
tags:
- malware
- evasive
