title: Win_malicious_confidence_90_ malware detection
id: Win_mali-5c029501
status: experimental
description: Detects Win_malicious_confidence_90_ malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains ability to execute an application (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains registry location strings
  - EventType: Loads the Bcrypt module DLL
  - EventType: Creates mutants
  - EventType: Overview of unique CLSIDs touched in registry
  - EventType: Contains SQL queries
  - EventType: Contains PDB pathways
  condition: selection
tags:
- malware
- Win_malicious_confidence_90_
