title: Win_malicious_confidence_90_ malware detection
id: Win_mali-e0d8df9e
status: experimental
description: Detects Win_malicious_confidence_90_ malware
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  - EventType: Contains ability to execute an application (API string)
  - EventType: Contains ability to create directories (API string)
  - EventType: Contains ability to create/open files (API string)
  - EventType: Contains ability to create a new process (API string)
  - EventType: Contains ability to disable/close registry key (API string)
  - EventType: Contains registry location strings
  - EventType: Uses 32 bit executable PE
  - EventType: PE file entrypoint instructions
  - EventType: Contains ability to set/get the last-error code for a calling thread
      (API string)
  - EventType: Able to create/load registry keys (API string)
  condition: selection
tags:
- malware
- Win_malicious_confidence_90_
